//1. Створити дві числові змінні, зберегти  результат їх суми у третю змінну та вивести отримане значення у консоль
let name1 = 12;
let name2 = 35;
let task1 = name1 + name2;
console.log(task1);

//2. З результуючої змінної першого завдання відняти 50, зберігти результат у новій змінній та вивести у консоль

let task2 = task1 - 50;
console.log(task2);

//3. Змінну з результатом другого завдання помножити на змінну з результатом першого завдання, зберігти результат у новій змінній та вивести у консоль

let task3 = task2 * task1;
console.log(task3);

//4. Змінну з результатом третього завдання поділити на 2.687, результат зберігти у нову змінну та вивести її в консоль. Також в окрему змінну винести залишок від ділення на те саме число і вивести у консоль

let task4a = task3 / 2.687;
console.log(task4a);

let task4b = task3 % 2.687;
console.log(task4b);

//5. Привести будь яку зі створенних раніше змінних до булевого значення, результат зберігти та вивести у консоль

console.log(!!task1);

//Скоротити настуний код за допомогою присвоючих операторів:

let num = 5;

//num = num +10;
console.log(num+=10);

//num = num * 2;
console.log(num*=2);

//num = num - 4;
console.log(num-=4);

//num = num / 6;
console.log(num/=6);